#### Combining and merging datasets with pandas

In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'key':['LA','NY','NJ','Washington','Boston','St.Louis','Baltimore'],'data1':range(7)})

In [9]:
df2 = pd.DataFrame({'key':['LA','NY','Las Vegas'],'data2':range(3)})

In [10]:
### Many-to-one join

In [11]:
pd.merge(df1,df2)

   data1 key  data2
0      0  LA      0
1      1  NY      1

In [12]:
pd.merge(df1,df2,on = 'key')

   data1 key  data2
0      0  LA      0
1      1  NY      1

In [17]:
df3 = pd.DataFrame({'lkey':['LA','NY','NJ','Washington','Boston','St.Louis','Baltimore'],'data1':range(7)})
df3

   data1        lkey
0      0          LA
1      1          NY
2      2          NJ
3      3  Washington
4      4      Boston
5      5    St.Louis
6      6   Baltimore

In [18]:
df4 = pd.DataFrame({'rkey':['LA','NY','Las Vegas'],'data2':range(3)})
df4

   data2       rkey
0      0         LA
1      1         NY
2      2  Las Vegas

In [19]:
pd.merge(df3,df4,left_on = 'lkey',right_on = 'rkey')

   data1 lkey  data2 rkey
0      0   LA      0   LA
1      1   NY      1   NY

In [22]:
pd.merge(df1,df2,how = 'outer')

   data1         key  data2
0    0.0          LA    0.0
1    1.0          NY    1.0
2    2.0          NJ    NaN
3    3.0  Washington    NaN
4    4.0      Boston    NaN
5    5.0    St.Louis    NaN
6    6.0   Baltimore    NaN
7    NaN   Las Vegas    2.0

In [ ]:
#### There are many merging operations which includes 
#### 1) Merging on index
#### 2) Concatenating Alon an axis
#### 3) Joins(left_on,right_on,left_index,right_index)